
## Plan Result (prod/domain)

[CI link](https://github.com/tqer39/edu-quest/actions/runs/18666568066)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.domain_register_delegate.google_clouddomains_registration.root[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.domain_register_delegate.google_clouddomains_registration.root[0] will be created
  + resource "google_clouddomains_registration" "root" {
      + create_time             = (known after apply)
      + domain_name             = "edu-quest.app"
      + domain_notices          = [
          + "HSTS_PRELOADED",
        ]
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time             = (known after apply)
      + id                      = (known after apply)
      + issues                  = (known after apply)
      + location                = "global"
      + name                    = (known after apply)
      + project                 = "portfolio-391320"
      + register_failure_reason = (known after apply)
      + state                   = (known after apply)
      + supported_privacy       = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }

      + contact_settings {
          + privacy = "REDACTED_CONTACT_DATA"

          + admin_contact {
              + email        = (sensitive value)
              + phone_number = (sensitive value)

              + postal_address {
                  + address_lines       = (sensitive value)
                  + administrative_area = (sensitive value)
                  + locality            = (sensitive value)
                  + postal_code         = (sensitive value)
                  + recipients          = [
                      + (sensitive value),
                    ]
                  + region_code         = (sensitive value)
                }
            }

          + registrant_contact {
              + email        = (sensitive value)
              + phone_number = (sensitive value)

              + postal_address {
                  + address_lines       = (sensitive value)
                  + administrative_area = (sensitive value)
                  + locality            = (sensitive value)
                  + postal_code         = (sensitive value)
                  + recipients          = [
                      + (sensitive value),
                    ]
                  + region_code         = (sensitive value)
                }
            }

          + technical_contact {
              + email        = (sensitive value)
              + phone_number = (sensitive value)

              + postal_address {
                  + address_lines       = (sensitive value)
                  + administrative_area = (sensitive value)
                  + locality            = (sensitive value)
                  + postal_code         = (sensitive value)
                  + recipients          = [
                      + (sensitive value),
                    ]
                  + region_code         = (sensitive value)
                }
            }
        }

      + dns_settings {
          + custom_dns {
              + name_servers = [
                  + "rick.ns.cloudflare.com",
                  + "roxy.ns.cloudflare.com",
                ]
            }
        }

      + management_settings (known after apply)

      + timeouts {
          + create = "10m"
          + update = "10m"
        }

      + yearly_price {
          + currency_code = (sensitive value)
          + units         = (sensitive value)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + registration_state      = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-prod","PRNumber":118,"Program":"tfcmt","SHA1":"62f45ffa389a6997d9a8a21cfadf1021f36e4d76","Target":"prod/domain","Vars":{},"WorkflowName":"Terraform - prod"} -->